music_app/app/models/user.rb

    def self.find_by_credentials(email, pass)
        user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "pizzaman@pizzafans.com"], ["LIMIT", 1]]

    def reset_session_token!
        self.update!(session_token: SecureRandom::urlsafe_base64)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "w8EMlIwEkylz-M1yrUgPbA"], ["updated_at", "2020-12-08 19:24:28.975687"], ["id", 4]]