music_app/app/controllers/application_controller.rb

    def current_user
        return nil if session[:session_token] == nil
        @user = User.find_by(session_token: session[:session_token]) if @user == nil
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "V8lR7vBI9lBMappyfwRvoQ"], ["LIMIT", 1]]